In [1]:
import pandas as pd

In [5]:
india_weather = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore"],
    "temperature":[7,12,20],
    "humidity":[3,5,1],
})

In [6]:
india_weather

       city  temperature  humidity
0    Mumbai            7         3
1      Pune           12         5
2  Banglore           20         1

In [7]:
usa_weather = pd.DataFrame({
    "city":["New York","Chicago","Los Angles"],
    "temperature":[17,22,30],
    "humidity":[13,10,15],
})

In [8]:
usa_weather

         city  temperature  humidity
0    New York           17        13
1     Chicago           22        10
2  Los Angles           30        15

In [9]:
idt_us = pd.concat([india_weather,usa_weather])

In [10]:
idt_us

         city  temperature  humidity
0      Mumbai            7         3
1        Pune           12         5
2    Banglore           20         1
0    New York           17        13
1     Chicago           22        10
2  Los Angles           30        15

In [11]:
idt_us = pd.concat([india_weather,usa_weather],ignore_index=True)
idt_us

         city  temperature  humidity
0      Mumbai            7         3
1        Pune           12         5
2    Banglore           20         1
3    New York           17        13
4     Chicago           22        10
5  Los Angles           30        15

In [16]:
idt_us = pd.concat([india_weather,usa_weather],keys=["India","USA"])
idt_us

               city  temperature  humidity
India 0      Mumbai            7         3
      1        Pune           12         5
      2    Banglore           20         1
USA   0    New York           17        13
      1     Chicago           22        10
      2  Los Angles           30        15

In [18]:
idt_us.loc["USA"]

         city  temperature  humidity
0    New York           17        13
1     Chicago           22        10
2  Los Angles           30        15

In [20]:
temperature = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore"],
    "temperature":[7,12,20]
})
temperature

       city  temperature
0    Mumbai            7
1      Pune           12
2  Banglore           20

In [21]:
humidity = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore"],
    "humidity":[13,10,15]
})
humidity

       city  humidity
0    Mumbai        13
1      Pune        10
2  Banglore        15

In [22]:
df = pd.concat([temperature,humidity])

c:\python\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [23]:
df

       city  humidity  temperature
0    Mumbai       NaN          7.0
1      Pune       NaN         12.0
2  Banglore       NaN         20.0
0    Mumbai      13.0          NaN
1      Pune      10.0          NaN
2  Banglore      15.0          NaN

In [25]:
df = pd.concat([temperature,humidity],axis=1)
df

       city  temperature      city  humidity
0    Mumbai            7    Mumbai        13
1      Pune           12      Pune        10
2  Banglore           20  Banglore        15

In [26]:
temperature = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore"],
    "temperature":[7,12,20]
})
temperature

       city  temperature
0    Mumbai            7
1      Pune           12
2  Banglore           20

In [27]:
humidity = pd.DataFrame({
    "city":["Pune","Mumbai"],
    "humidity":[13,10]
})
humidity

     city  humidity
0    Pune        13
1  Mumbai        10

In [30]:
df = pd.concat([temperature,humidity],axis=1)
df

       city  temperature    city  humidity
0    Mumbai            7    Pune      13.0
1      Pune           12  Mumbai      10.0
2  Banglore           20     NaN       NaN

In [32]:
temperature = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore"],
    "temperature":[7,12,20]
},index = [0,1,2])
temperature

       city  temperature
0    Mumbai            7
1      Pune           12
2  Banglore           20

In [33]:
humidity = pd.DataFrame({
    "city":["Pune","Mumbai"],
    "humidity":[13,10]
}, index = [1,0])
humidity

     city  humidity
1    Pune        13
0  Mumbai        10

In [1]:
df = pd.concat([temperature,humidity],axis=1)

NameError: name 'pd' is not defined

In [35]:
df

       city  temperature    city  humidity
0    Mumbai            7  Mumbai      10.0
1      Pune           12    Pune      13.0
2  Banglore           20     NaN       NaN

In [36]:
s = pd.Series(["Humid","Sunny","Rain"],name="Event")

In [37]:
s

0    Humid
1    Sunny
2     Rain
Name: Event, dtype: object

In [38]:
df = pd.concat([temperature,s],axis=1)

In [39]:
df

       city  temperature  Event
0    Mumbai            7  Humid
1      Pune           12  Sunny
2  Banglore           20   Rain